app/controllers/houses_controller.rb

def update
  @house = House.find(params[:id])

  if @house.update(house_params)
---
UPDATE "houses" SET "image" = $1 WHERE "houses"."id" = $2  [["image", "https://vignette.wikia.nocookie.net/gameofthrones/images/8/8a/House-Stark-Main-Shield.PNG/revision/latest?cb=20170101103142"], ["id", 3]]

def create
  @house = House.new(house_params)

  if @house.save
---
INSERT INTO "houses" ("name", "motto", "author", "source_material", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"