app/controllers/members_controller.rb

  def create
    @house = House.find_by(id: params[:house_id])
    @members = @house.members
    @member = Member.new(member_params)
    @house = House.find_by(id: params[:house_id])
    @member.house = @house


    if @member.save
---
SELECT "members".* FROM "members" WHERE "members"."house_id" = $1  [["house_id", "2"]]
INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Renly "], ["last_name", "Baratheon"], ["house_id", "1"], ["created_at", "2018-01-18 19:29:37.058246"], ["updated_at", "2018-01-18 19:29:37.058246"]]